{
  "HomePage": {
    "project_two": "The project is a full-stack application developed with React that incorporates both REST and GraphQL API clients, along with user authentication powered by Firebase. The RESTful client allows users to interact with any REST API, providing essential features like a method selector (GET, POST, PUT, DELETE, etc.), a text input for entering API endpoint URLs, and a request body editor for sending data in requests such as POST or PUT.The project also integrates Firebase Authentication, enabling users to register, log in, and manage authentication seamlessly. Firebase ensures secure authentication for users, which is critical for handling requests that require user sessions.",
    "project_one": "In addition to the REST client, the project also includes a GraphiQL client to interact with GraphQL APIs.This client offers a query editor where users can write and execute GraphQL queries or mutations, a variables editor for passing dynamic data, and a headers editor for customizing the HTTP request. It features an input field for the GraphQL schema documentation endpoint and includes a documentation explorer that enables users to browse and interact with the API schema (SDL). The response section displays the results, including data or errors. Moreover, the project supports language interpolation, allowing dynamic content based on user-selected languages. This ensures the UI can be easily localized, providing a personalized experience for users from different regions.",
    "projet_title": "About the Project",
    "course_one": "The React course on the RS School platform is designed for those who already have basic knowledge of JavaScript,TypeScript, Git, NPM and Webpack. The program is free and conducted online. It is designed for students who have completed JavaScript Stage 2 at RS School, as well as beginners with experience working with the above-mentioned technologies.The course includes studying the basics of React, as well as tools such as Redux, Next.js and other ecosystem solutions. Students learn to create modern interfaces, work with the state of the application and implement complex user interfaces.",
    "course_two": "The training takes place under the guidance of experienced mentors who are developers with many years of experience in React and front-end development.In addition, participants get access to training materials and video tutorials, and a certificate is issued upon completion of the course. The course supports the \"Pay it forward\" philosophy, where graduates can become mentors for new students.",
    "course_title": "About the Course",
    "member_title":"Our Team",
    "first_member-name": "Mikhail",
    "first_member-lastName": "Mikhail",
    "first_member-role": "Team lead",
    "first_member-bio": "I'm a front-end developer", 
    "second_member-name": "Dmitrii",
    "second_member-lastName": "Samsonenko",
    "second_member-role": "Developer",
    "second_member-bio": "I'm a Python developer with a background in embedded systems, where I developed software in C for various devices and measurement systems.  I'm transitioning to web development with a focus on backend roles, while also cultivating an interest in frontend development and other web-related skills. Self-education is a key part of my professional development. I enjoy learning new skills and strive to communicate effectively with all team members. The most rewarding aspect of my work is creating new applications or features that are both functional and beneficial. ",
    "third_member-name": "Mykhailo",
    "third_member-lastName": "Nikolaiev",
    "third_member-role": "Developer",
    "third_member-bio": "I'm a front-end developer specializing in building web applications with React and TypeScript. I focus on delivering high-quality user experiences and writing clean, maintainable code. My goal is to achieve efficiency and excellence in every project, creating modern and visually appealing web solutions"
  
  }
}
